{
  "map": [
    {
      "tiles": {
      },
      "config": {
        "enableMyLocation": "false"
      },
      "markers": {
      }
    }
  ],
  "speakers": [
    {
      "id": "53be55cd12ac84a993000076",
      "name": "Peter Talbot",
      "website": "http://petertalbot.me",
      "title": "Lead Visual Designer at Outware Mobile",
      "bio": "Peter has over ten years experience gained across Australia, the UK and North America. Before returning home to Melbourne and heading up the Visual Design Team at Outware Mobile, Peter was a key member of the Nokia UX team in Vancouver.",
      "company": "",
      "present_photo": true,
      "picture": "807ec20b-864f-419a-a96b-77a0ad309762.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53be55cd12ac84a993000076/sanitized_807ec20b-864f-419a-a96b-77a0ad309762.png",
      "twitter_handle": "@tbag"
    },
    {
      "id": "53be5fcc56aa1aad3a000004",
      "name": "Adil Mughal ",
      "website": "http://www.adilmughal.com",
      "title": "Senior Developer at Nintex, Microsoft MVP",
      "bio": "Adil is Senior Developer at Nintex, where he contributes in developing native mobile apps on Android, iOS and Windows platform. He has extensive experience on designing and developing enterprise scale applications on the web and mobile. Besides his day to day job, he is active in online and offline technical communities. He has been awarded Most Valuable Professional (MVP) by Microsoft for his technical community leadership. ",
      "company": "",
      "present_photo": true,
      "picture": "91e9fe3d-ff82-4aff-8cd2-9478c8bf41c3.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53be5fcc56aa1aad3a000004/sanitized_91e9fe3d-ff82-4aff-8cd2-9478c8bf41c3.png",
      "twitter_handle": "@adilamughal"
    },
    {
      "id": "53c3a83208739813f300000d",
      "name": "Pece Nikolovski",
      "website": "https://www.linkedin.com/pub/pece-nikolovski/20/352/274",
      "title": "Mobile app developer and Team Leader at Outware Mobile",
      "bio": "Pece Nikolovski is a mobile app developer and team leader at Outware Mobile. An Australian company that specializes in mobile software development He leads a team of developers, and provides them the necessary support and guidance to build some of the most popular mobile apps in Australia like AFL, Cricket and NRL.\r\n\r\nPace has over 8 years of experience as a software developer with more than 5 years of Android development. His passion for mobile development has been building since the early days of Android Mobile OS.\r\n\r\nBut Android is not his one and only preference in the mobile world. He is also passionate about iOS development. One of his challenges is finding the best of the two worlds, and making developers life easier by bridging the differences between the two major players in the mobile industry.",
      "company": "",
      "present_photo": true,
      "picture": "7b93b917-892c-4125-af77-f74fe015cc80.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c3a83208739813f300000d/sanitized_7b93b917-892c-4125-af77-f74fe015cc80.png",
      "twitter_handle": "@pece_nikolovski"
    },
    {
      "id": "53c48f953a50271d080000c8",
      "name": "Ben Scheirman",
      "website": "http://benscheirman.com",
      "title": "Director of Technology for ChaiOne, founder of NSScreencast",
      "bio": "Ben Scheirman is an experienced software developer, screencaster, speaker, and author. He's been developing software for nearly 15 years, and currently focuses on Ruby and iOS. Ben is the founder of NSScreencast, where he publishes a new screencast on iOS development each week.\r\n\r\nWhen not programming, Ben enjoys playing guitar, drinking beer, and spending time with his wife and five wonderful children. Ben is the Director of Technology for ChaiOne in Houston, TX.",
      "company": "",
      "present_photo": true,
      "picture": "d7853c52-77c2-4a1d-ac81-ad5596f57b08.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c48f953a50271d080000c8/sanitized_d7853c52-77c2-4a1d-ac81-ad5596f57b08.png",
      "twitter_handle": "@subdigital"
    },
    {
      "id": "53c3c3b83a50279fa400001b",
      "name": "Paris Buttfield-Addison",
      "website": "http://blog.paris.id.au/",
      "title": "Co-Founder of Secret Lab, author of numerous iOS related books",
      "bio": "Paris Buttfield-Addison is the co-founder of Secret Lab, a mobile development studio based in Hobart, Tasmania, and author of mobile development books. Recent apps include the ABC Play School Play Time app, and recent books include ‘Learning Cocoa with Objective-C 4th Edition’, ‘iOS Game Development Cookbook’, and the upcoming ‘Swift Development with Cocoa’",
      "company": "",
      "present_photo": true,
      "picture": "ac7b6c64-6767-440b-9b5f-770637385202.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c3c3b83a50279fa400001b/sanitized_ac7b6c64-6767-440b-9b5f-770637385202.png",
      "twitter_handle": "@parisba"
    },
    {
      "id": "53ce2c8a0542101d040000aa",
      "name": "Jon Manning",
      "website": "http://www.secretlab.com.au/",
      "title": "iOS Development Trainer & Writer, author of numerous iOS books",
      "bio": "Jon Manning is a world renown iOS development trainer and writer, game designer and mobile software engineering wizard.\r\n\r\nHe has co-authored two books on mobile development and enjoys re-implementing such things as OpenGL and the Objective-C runtime (in his spare time).\r\n\r\nJon is also a researcher in Human-Computer Interaction working towards a PhD.",
      "company": "",
      "present_photo": true,
      "picture": "6498c8a5-3f9e-4718-91b8-61a3419f8149.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53ce2c8a0542101d040000aa/sanitized_6498c8a5-3f9e-4718-91b8-61a3419f8149.png",
      "twitter_handle": "@desplesda"
    },
    {
      "id": "53be62c93b455bd07d000007",
      "name": "Cesare Rocchi",
      "website": "http://www.studiomagnolia.com",
      "title": "Speaker, writer, UX designer and developer",
      "bio": "Cesare Rocchi is a speaker, writer, UX designer and developer specializing in web and mobile applications. He began working on interactive applications while he was a researcher in the academia. He runs a Studio Magnolia, an interactive studio that creates compelling web and mobile applications. When off duty he enjoys snowboard and beach tennis.",
      "company": "",
      "present_photo": true,
      "picture": "491975ad-e679-4cf1-851d-a8a3bbf01ca3.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53be62c93b455bd07d000007/sanitized_491975ad-e679-4cf1-851d-a8a3bbf01ca3.png",
      "twitter_handle": "@_funkyboy"
    },
    {
      "id": "53c55549ae37c798de000029",
      "name": "Ben Teese",
      "website": "http://blog.shinetech.com/author/benteeseshinetech/",
      "title": "Senior Consultant at Shine Technologies",
      "bio": "Ben Teese is a senior software developer at Shine Technologies. He spent 10 years as a back-end developer before deciding that perhaps the Web wasn’t a fad after all. After being kidnapped by Javascript and CSS, he quickly succumbed to Stockholm syndrome and now fights alongside them to make the web a better place. He spends most of his time building mobile websites, because that’s the only sort of website that anybody seems to want anymore.",
      "company": "",
      "present_photo": true,
      "picture": "00df99ef-6fcc-4236-8acb-1351fad6873e.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c55549ae37c798de000029/sanitized_00df99ef-6fcc-4236-8acb-1351fad6873e.png",
      "twitter_handle": "@benteese"
    },
    {
      "id": "53cde1580542103447000056",
      "name": "Marty Andrews",
      "website": "http://www.cogent.co/",
      "title": "Founder and CEO of Cogent, Director of Smash Wearables",
      "bio": "Marty is the founder and CEO at Cogent - a software business in Melbourne.  Since 2007, Cogent has been an ongoing successful experiment in running an open, values driven business.  They use skills in strategy, design and development to help customers build useful products.  Cogent is also a place where Marty helps create his own new startups and invests in others.\r\n\r\nIn his younger days, Marty spent a lot of time in dingy pool halls around the eastern suburbs of Melbourne.  He played for the Victorian 8-Ball team in 1999 and 2005, but is now semi-retired, preferring to spend time with his wife and 2 young boys.",
      "company": "",
      "present_photo": true,
      "picture": "2aeb7f25-8e90-429f-9117-4f104b065531.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53cde1580542103447000056/sanitized_2aeb7f25-8e90-429f-9117-4f104b065531.png",
      "twitter_handle": "@martinjandrews"
    },
    {
      "id": "53cde552054210a60100005b",
      "name": "J. Matthew Pryor",
      "website": "http://observant.com.au/",
      "title": "CEO at Observant, Experienced entrepreneur",
      "bio": "An experienced entrepreneur, Matthew has operated at senior levels for information technology firms in Australia and the USA. After 6 years in San Francisco which included the rapid growth and eventual acquisition of Verve, a company he co-founded, Matthew returned to Australia. After stints with several US owned technology companies, Matthew joined the investors at Observant, eventually taking on the role of CEO. Observant is helping to reshape the future of agribusiness. Leveraging cloud based infrastructure with custom designed, solar powered, autonomous devices. Its product C3, won an Australian International Design Award 2013 & 2012 Irrigation Australia New Product/Innovation Award. It a flexible monitoring & control platform to drive improvements in water & energy efficiency in agriculture. It can be configured for modular operations or complete stand-alone operations when paired with Observant’s robust, tamper and vandal proof solar enclosure. Observant does IoT for the real world - dusty, hot & remote.",
      "company": "",
      "present_photo": true,
      "picture": "97644c6f-a763-4ab5-b573-2845680a1f9b.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53cde552054210a60100005b/sanitized_97644c6f-a763-4ab5-b573-2845680a1f9b.png",
      "twitter_handle": "@jmatthewpryor"
    },
    {
      "id": "53e1b54114296fa7820001d4",
      "name": "Anthony Kahl",
      "website": "http://www.linkedin.com/pub/anthony-kahl/a/540/aab",
      "title": "Maker, Engineer & Designer at Observant",
      "bio": "Long time maker and engineer, Anthony has lead numerous product development cycles since joining Observant in 2005. He has a breadth of knowledge across electronics and firmware, industrial design, packaging design and manufacturing. Observant has won a number of industry awards for products he has designed, including a coveted Australian Design Award.",
      "company": "",
      "present_photo": true,
      "picture": "50405435-34e1-42ef-b6e4-c20b9f949811.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53e1b54114296fa7820001d4/sanitized_50405435-34e1-42ef-b6e4-c20b9f949811.png",
      "twitter_handle": "@ajkahl"
    },
    {
      "id": "512eecd8e7f0eca3f000003e",
      "name": "Stewart Gleadow",
      "website": "http://www.stewgleadow.com",
      "title": "Technical Lead at REA Group, Mobile/iOS Developer & Envangelist",
      "bio": "Stewart Gleadow is a Technical Lead and Mobile Evangelist at REA Group in Australia, working primarily on the iOS apps and mobile APIs for realestate.com.au. Stewart has extensive experience in agile software projects, and how to combine agile methods with mobile product and delivery teams. His particular areas of focus are on sustainable mobile architectures, APIs, maintainable iOS apps and automated app testing.",
      "company": "",
      "present_photo": true,
      "picture": "f078486a-0af4-4764-9978-3f9955246c8c.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/512eecd8e7f0eca3f000003e/sanitized_f078486a-0af4-4764-9978-3f9955246c8c.png",
      "twitter_handle": "@stewgleadow"
    },
    {
      "id": "53ce0dd1513b8879b6000084",
      "name": "Alex Johnston",
      "website": "http://dribbble.com/alexjston",
      "title": "Co-Founder / Designer of Cook and OzTV",
      "bio": "Alex is the co-founder and designer of Cook and OzTV. He previously consulted for various companies including Sensis, GE & NAB.",
      "company": "",
      "present_photo": true,
      "picture": "fecac235-5fbe-483a-88d7-60a6345ad293.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53ce0dd1513b8879b6000084/sanitized_fecac235-5fbe-483a-88d7-60a6345ad293.png",
      "twitter_handle": "@alexjston"
    },
    {
      "id": "53bc9d8830f4a0dc6400014c",
      "name": "Maksim Lin",
      "website": "http://manichord.com",
      "title": "Freelance developer, Android specialist",
      "bio": "Maksim is a freelance developer who over the years has worked on everything from phone exchanges to large corporate websites to mobile webapps and Android app development. Previously senior developer at the National Gallery of Victoria, he now specialises in Android\r\ndevelopment and he's spent the last few years working on various parts of the Android OS from user apps all the way down to the Linux kernel.",
      "company": "",
      "present_photo": true,
      "picture": "efa302c1-9b10-45bc-b28d-bfa25ea47631.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53bc9d8830f4a0dc6400014c/sanitized_efa302c1-9b10-45bc-b28d-bfa25ea47631.png",
      "twitter_handle": "@mklin"
    },
    {
      "id": "53c3c3583a502760d1000017",
      "name": "Luke Toop",
      "website": "http://luketoop.com",
      "title": "iOS Developer at Sportsbet.com.au",
      "bio": "Luke Toop is an iOS developer at Sportsbet.com.au, where he has spent almost two years executing Tyrone's devious plans. Luke started creating OSX real-time video applications for businesses in 2006 and switched to iOS development in 2008. He has worked on a range of applications both inside and outside the App Store, the most exciting of which was Adelaide startup MenuPad.\r\n\r\nLuke loves Lisp, and hopes the functional programming facilities in Swift will introduce more professional programmers to this paradigm.",
      "company": "",
      "present_photo": true,
      "picture": "bc4a7f72-8d3a-4e93-a8a2-dee7ab4f4ded.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c3c3583a502760d1000017/sanitized_bc4a7f72-8d3a-4e93-a8a2-dee7ab4f4ded.png",
      "twitter_handle": "@luketoop"
    },
    {
      "id": "53c3c3813a50271d08000019",
      "name": "Tyrone Trevorrow",
      "website": "https://github.com/tyrone-sudeium",
      "title": "iOS Developer at Sportsbet.com.au",
      "bio": "Tyrone Trevorrow is an iOS developer at Sportsbet.com.au where he brought together a team to take the company’s existing web app and redevelop it as an entirely native experience over the course of two years. Tyrone has been working on iOS apps professionally for over four years, and working with Objective-C for over seven. He has shipped apps for Sportsbet, Dominos Australia, TattsBet, Queensland Department of Premier and Cabinet, Ekka: Royal Queensland Show and others. In his spare time, Tyrone works on an as yet unannounced project that aims to reimagine the way group chats work online.\r\n\r\nTyrone is a self confessed Objective-C enthusiast by trade, but a Rubyist at heart, and is for this reason very excited by the new levels of expressiveness possible in Swift coupled with the powerful dynamism of the Objective-C runtime.",
      "company": "",
      "present_photo": true,
      "picture": "a205489c-e2fe-477c-94a7-8de5a7abd22a.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c3c3813a50271d08000019/sanitized_a205489c-e2fe-477c-94a7-8de5a7abd22a.png",
      "twitter_handle": "@aetherealle"
    },
    {
      "id": "53bfe88e4ec0fd85a800001b",
      "name": "Ben Melbourne",
      "website": "http://asinthecity.com/",
      "title": "Experience Design Consultant at ThoughtWorks",
      "bio": "Ben’s current business card says he’s an Experience Design Consultant at ThoughtWorks where he does a combination of design strategy, software delivery and preaching about the importance of the mobile channel to companies trying to find their way in the brave new world of digital natives.\r\n\r\nWith over a decade of experience, he has designed his way through the rise of the smartphone and seen mobile evolve from an afterthought of m. sites to creating the constant always connected world we live in.",
      "company": "",
      "present_photo": true,
      "picture": "43ab8c5a-4f66-48b0-8e70-80f7b4a62a1b.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53bfe88e4ec0fd85a800001b/sanitized_43ab8c5a-4f66-48b0-8e70-80f7b4a62a1b.png",
      "twitter_handle": "@benmelb"
    },
    {
      "id": "53ce24af513b88d51d0000a7",
      "name": "Toby Pritchard",
      "website": "https://www.linkedin.com/pub/toby-pritchard/24/b98/287",
      "title": "Business Analyst at Suncorp",
      "bio": "Toby Pritchard has 6 years’ experience as a Business Analyst in different industries and is currently working for Suncorp Group, assisting with the Bank’s digital channels.  With technology impacting heavily in the financial sector, Toby is excited by the changing nature of banking and the way companies must adapt their customers interactions.\r\n\r\nJumping into the world of UX, Toby has welcomed the new challenges in learning techniques in collaborative design, usability testing and mobile first approaches. Being a nerd at heart means Toby successfully bridges the gap between development teams and business stakeholders, whilst making sure that customer focussed designs are number one priority.",
      "company": "",
      "present_photo": true,
      "picture": "33ef1c16-b6f3-45aa-94ab-d0d7c88bf739.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53ce24af513b88d51d0000a7/sanitized_33ef1c16-b6f3-45aa-94ab-d0d7c88bf739.png",
      "twitter_handle": "@pritchard_toby"
    },
    {
      "id": "53c4ef50ae37c75eb300000a",
      "name": "Luke Sleeman",
      "website": "http://lukesleeman.com.au",
      "title": "Freelance Android developer",
      "bio": "Luke Sleeman is a freelance developer specialising in Android apps. Luke has a passion for Android and design. After 7 years leading teams developing java apps, he decided to pursue his passions and make the leap to freelance Android development. Luke has worked on a number of exciting projects from producing tiny MVP’s for startups, to developing apps for large international brands. Some of the highlights include working with the digital agency “Involved” to produce the Accor hotels Asia Pacific app, which was featured in the play store as an editors pick and developing EnhanceBooth for Amasso Apps which went straight to the top of the Australian paid charts in its section and picked up over 120k users in the first month. Luke can be contacted via luke.sleeman@gmail.com ",
      "company": "",
      "present_photo": true,
      "picture": "e03a6979-abff-4d4f-baa6-4f2fb66f5eca.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c4ef50ae37c75eb300000a/sanitized_e03a6979-abff-4d4f-baa6-4f2fb66f5eca.png",
      "twitter_handle": "@LukeSleeman"
    },
    {
      "id": "5357b3af5fac669b95000009",
      "name": "David Colls",
      "website": "http://safetydave.net/",
      "title": "Consultant at ThoughtWorks, Problem Solver",
      "bio": "David is a consultant with ThoughtWorks, a visual thinker, and part-time mathematician. He enjoys helping diverse teams comes to grips with challenging problems, and is an experienced leader of product R&D and organisational design initiatives. Much of his early career was spent building software that models or interacts with the physical world, from precision manufacturing to concept cars.",
      "company": "",
      "present_photo": true,
      "picture": "4a885d43-76b5-470d-b745-444ad00456f4.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/5357b3af5fac669b95000009/sanitized_4a885d43-76b5-470d-b745-444ad00456f4.png",
      "twitter_handle": "@davidcolls"
    },
    {
      "id": "5360b0718e061cab9b000a0d",
      "name": "Nathan Jones",
      "website": "https://github.com/thenathanjones",
      "title": "Software Developer at ThoughtWorks, Hunter - Gatherer",
      "bio": "Nathan is a Software Developer for ThoughtWorks based in Perth. Nathan's focus is getting stuff done. This means he works with a variety of different languages/frameworks/environments, and is quite happy to learn something new when it's the right tool for the job. He is equally happy driving better user experience from the front end or corralling hardware on the backend.",
      "company": "",
      "present_photo": true,
      "picture": "b8c4b40d-0b90-4b42-8422-33cec1c6f46e.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/5360b0718e061cab9b000a0d/sanitized_b8c4b40d-0b90-4b42-8422-33cec1c6f46e.png",
      "twitter_handle": "@the_nathanjones"
    },
    {
      "id": "53ce304a0542101d040000c9",
      "name": "Justin Mclean",
      "website": "http://www.classsoftware.com/",
      "title": "Consultant and trainer at Class Software, Contributor to Apache Flex, organiser of Sydney IoT meetup",
      "bio": "Justin Mclean has more than 15 years experience in developing web based applications and over that time has worked on hundreds of database driven web sites, mobile applications and desktop applications. He has seen significant changes of technology in the industry, surviving the browser wars and the dot-com bubble. Justin has a keen interest in the open source hardware movement and it's huge potential.\r\n\r\nJustin runs his own consulting company Class Software, runs regular training courses and has spoken at numerous conferences in Australia and overseas.\r\n\r\nIn his free time he's active in the Apache Flex project including being the release manager for several versions of Apache Flex and Flex Unit. He’s on the Apache Incubator PMC and is an Apache member. He's also co-author of a book on Android mobile development and runs the IoT (internet of things) meetup in Sydney.",
      "company": "",
      "present_photo": true,
      "picture": "4883d6d8-c7d7-43fe-b3f0-f8c867c9ee91.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53ce304a0542101d040000c9/sanitized_4883d6d8-c7d7-43fe-b3f0-f8c867c9ee91.png",
      "twitter_handle": "@JustinMclean"
    },
    {
      "id": "53c3c1b80873983879000016",
      "name": "Cam Smith",
      "website": "https://www.linkedin.com/in/cameronpsmith",
      "title": "Senior Consultant at DiUS",
      "bio": "I'm a software developer and consultant with over 15 years experience in the technology industry, including the last decade as a technical and delivery lead.  I'm a generalist in every sense, and work in all project situations, from R&D and fields of green through to legacy rehabilitation and project rescue.\r\n\r\nI'm passionate about computing at the extremes, and the combination and juxtaposition of low power, connected devices with hulking, autonomous cloud rigs.  It's a thing I call Tiny Huge Computing, and I love the idea that any developer can improve their chops by becoming accustomed to the all the different idioms of scale, from metal to massive.",
      "company": "",
      "present_photo": true,
      "picture": "1244c881-15dd-4503-b41b-5993b834fc03.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c3c1b80873983879000016/sanitized_1244c881-15dd-4503-b41b-5993b834fc03.png",
      "twitter_handle": "@smithcam"
    },
    {
      "id": "53ce39c205421071410000f0",
      "name": "Dineth Mendis",
      "website": "http://dinethmendis.com/",
      "title": "iOS & Android Developer at wotif.com",
      "bio": "Dineth is an iOS and Android developer, currently working as a mobile guru at wotif.com. He has a unique set of experiences from years of working with Brisbane based startups, including his own app company, M2D2. He's passionate about building great user experiences in mobile and believes in a multi-disciplinary approach to software development. He spends his day trying out new ideas. He only talks in snapchat and never eats anything before the evidence is submitted to Instagram.",
      "company": "",
      "present_photo": true,
      "picture": "0a3d4dc3-1aff-4326-8c7b-c77cb0529ac4.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53ce39c205421071410000f0/sanitized_0a3d4dc3-1aff-4326-8c7b-c77cb0529ac4.png",
      "twitter_handle": "@dineth"
    },
    {
      "id": "53ce380d513b8879b60000f2",
      "name": "Richard Sbresny",
      "website": "http://www.jotlab.com/",
      "title": "Passionate iOS Developer / Full Stack Developer",
      "bio": "Richard is a passionate iOS developer slash full stack developer; and not the other way around. Loving the iOS SDK with Rails or CakePHP backends Richard has been able to single handily craft up apps for the AppStore. Involved with brands Brisbane Comedy Festival, Thiess, Wotif, Brisbane Powerhouse & Brisbane Festival; he's had a diverse range of client encounters. He desparately needs a haircut but is usually too busy coding to book an appointment. After shipping many apps to a git graveyard, never seeing light of day, he's started to practice what the MVP gospel preaches, just ship it. Mew.",
      "company": "",
      "present_photo": true,
      "picture": "7899331b-633e-488b-8103-28b5c4377fa6.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53ce380d513b8879b60000f2/sanitized_7899331b-633e-488b-8103-28b5c4377fa6.png",
      "twitter_handle": "@voidet"
    },
    {
      "id": "53ce3c02513b88abf80000f9",
      "name": "Scott Horn",
      "website": "http://www.hornmicro.com/",
      "title": "Frontend Team Leader at wotif.com",
      "bio": "Scott has been working with user interfaces and computer systems for over 15 years. From building early GPRS consoles in trucks to modern responsive and native software. He has contributed to various open source projects from dropwizard to vert.x and is part of the swagger 2.0 working group. Scott's core belief is to enable creativity and value in software through implementing simple and connectable software. He is proud to represent the team from wotif.com as the front end house master. ",
      "company": "",
      "present_photo": true,
      "picture": "e83661ad-050b-4fc4-bd79-b0228e3a1437.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53ce3c02513b88abf80000f9/sanitized_e83661ad-050b-4fc4-bd79-b0228e3a1437.png",
      "twitter_handle": "@scottjhorn"
    },
    {
      "id": "53ce3b2e05421034470000f3",
      "name": "Sharim Chua",
      "website": "http://skintherabbit.blogspot.com/",
      "title": "Software Developer at wotif.com",
      "bio": "Sharim considers himself a tinkerer and technology enthusiast. He loves shiny gadgets emblazoned with half eaten fruit and has been developing mobile apps for the past three years. A self confessed jack of all trades, he has spent over a decade experimenting with everything from .NET to Scala. He now works at wotif.com developing apps and services to help customers discover great ways to travel.",
      "company": "",
      "present_photo": true,
      "picture": "373a3e63-5617-4943-8863-ef860fe386b3.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53ce3b2e05421034470000f3/sanitized_373a3e63-5617-4943-8863-ef860fe386b3.png",
      "twitter_handle": "@SharimChua"
    },
    {
      "id": "535b129681e8b002560003a9",
      "name": "Sam Ritchie",
      "website": "http://samritchie.net",
      "title": "Chief Codesplicer at Codesplice, Organiser of Perth iOS Developers",
      "bio": "Sam has an extensive background leading small, focused teams building in-house business systems in .NET. He’s been running Agile projects ever since he had a bad experience with PRINCE2, and would probably self-identify as an architect if he didn’t hate the ‘A’ word. He’s also been coding in Objective-C since before it was cool, a fact he tries to insert into every conversation.\r\n\r\nIn his spare time he likes to start projects he’s never going to finish, most of them involving one or more of iOS, CouchDB, LevelDB, F#, Ruby, and Arduino.",
      "company": "",
      "present_photo": true,
      "picture": "8a0e3b95-f175-4fc2-b13d-c95bc9f900d4.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/535b129681e8b002560003a9/sanitized_8a0e3b95-f175-4fc2-b13d-c95bc9f900d4.png",
      "twitter_handle": "@FakeSamRitchie"
    },
    {
      "id": "53c761e3e49e205920000042",
      "name": "Patrick Catanzariti",
      "website": "http://www.patrickcatanzariti.com",
      "title": "Web developer and SitePoint author",
      "bio": "A web developer and SitePoint author who loves any excuse to make a random demo to showcase new technology!",
      "company": "",
      "present_photo": true,
      "picture": "1c7837dd-9742-4e87-bd1c-d7c0e6e65502.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c761e3e49e205920000042/sanitized_1c7837dd-9742-4e87-bd1c-d7c0e6e65502.png",
      "twitter_handle": "@thatpatrickguy"
    },
    {
      "id": "53cf829a82350812d1000157",
      "name": "Michael Gianarakis",
      "website": "https://www.linkedin.com/in/michaelgianarakis",
      "title": "Practice Manager at Securus Global",
      "bio": "Michael Gianarakis is Practice Manager Securus Global in Melbourne, Australia. He specialises in mobile application security research. His work has assisted developers and organisations across most industry sectors secure their new and emerging mobile applications and platforms. Michael has presented his research at numerous industry events including OWASP and Ruxcon in Australia.",
      "company": "",
      "present_photo": true,
      "picture": "3142e6f0-4a4e-490f-83a9-2aed4c884e00.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53cf829a82350812d1000157/sanitized_3142e6f0-4a4e-490f-83a9-2aed4c884e00.png",
      "twitter_handle": "@mgianarakis"
    },
    {
      "id": "53c747b4a91dac5e12000046",
      "name": "Linden Darling",
      "website": "http://www.coreform.com.au",
      "title": "Android and Wearable Apps Developer",
      "bio": "With over 15 years experience in multimedia and engineering, Linden converges various complementary skills to provide design, development, and security of enterprise-level Android apps. He has lead the development of several high profile Australian apps (including banking, eHealth, and telco apps), and has presented on the topics of Android development and web application security around the world. Recently focusing on wearables, Linden has developed several head-mounted-wearable apps (for Google Glass and Vuzix M100), has seen his Mandala clockface design shipped on the Omate Truesmart, and has already several Android Wear apps under his belt. ",
      "company": "",
      "present_photo": true,
      "picture": "5509def7-77fc-4890-aa42-d86e7c7d4fb0.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c747b4a91dac5e12000046/sanitized_5509def7-77fc-4890-aa42-d86e7c7d4fb0.png",
      "twitter_handle": null
    },
    {
      "id": "53cf8cfb823508f8b100016b",
      "name": "Dave Glover",
      "website": "http://blogs.msdn.com/b/dglover/",
      "title": "Windows Phone Developer Evangelist at Microsoft",
      "bio": "Dave Glover has worked for Microsoft for over 20 years mostly in the Developer Experience Group, the first 10 years for Microsoft UK, he transfer to Microsoft Australia in 2004.  He has worked in various roles including people management and across a broad spectrum of infrastructure and developer technologies with a variety of customers and partners.  His main skills include Web, Services, Embedded, Mobile and Device development.",
      "company": "",
      "present_photo": true,
      "picture": "9c69d858-ddc3-4f4a-bd3d-9dc41bf38384.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53cf8cfb823508f8b100016b/sanitized_9c69d858-ddc3-4f4a-bd3d-9dc41bf38384.png",
      "twitter_handle": "@dglover"
    },
    {
      "id": "53bcaf4330f4a0dc64000194",
      "name": "Jaimee Newberry",
      "website": "http://jaimeejaimee.com",
      "title": "UX Strategy & Design consultant, speaker & writer",
      "bio": "Jaimee’s background runs the gamut from a degree in metal sculpture to professional work in production management helping coordinate events like broadcast for the Sydney 2000 Olympic Games. She moved on to GUI design and information architecture in the web start-up days, has taught management information systems, graphic design and interface design at UNLV, partnered in a boutique animation/interactive shop called Eatdrink, serving some of the world’s largest brands and agencies, and she led the efforts behind the first iPad, iPhone, and Android apps for Zappos in 2010-2011. In 2011-2013, she held post as Black Pixel’s Director of User Experience working on top secret iOS projects for Fortune 100 companies and promising startups.\r\n\r\nToday Jaimee provides executive and personal coaching, writes and speaks around the world sharing lessons in empathy, communication, experience design and technology. Jaimee is also the co-founder of @heybests | Bests.com, catalyst for @wwdcgirls | wwdcgirls.org, and co-host of Unprofessional.",
      "company": "",
      "present_photo": true,
      "picture": "7a0cae77-2838-44e4-a670-ca5508a42dcb.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53bcaf4330f4a0dc64000194/sanitized_7a0cae77-2838-44e4-a670-ca5508a42dcb.png",
      "twitter_handle": "@jaimeejaimee"
    },
    {
      "id": "53dd03e2ef70d532f100004d",
      "name": "Jonathan Oxer",
      "website": "http://jon.oxer.com.au/",
      "title": "Designer of satellite payload electronics, author of \"Practical Arduino\" & \"Ubuntu Hacks\"",
      "bio": "Jon has been hacking on both hardware and software since he was a little tacker. Most recently he's been focusing more on the Open Hardware side, co-founding Freetronics after organising the first Arduino Miniconf at linux.conf.au 2010. His books include \"Ubuntu Hacks, \"Practical Arduino\", and \"How To Build A Website And Stay Sane\". His Open Hardware projects include ArduPhone, the Arduino-based open cellphone, and the tiny LeoStick which is an Arduino-compatible board the size of a memory stick. His hardware is used by tens of thousands of hobbyists around the world and by companies including Weta Digital, Boston Dynamics, and the Australian Defence Science and Technology Organisation, and has even flown in space.\r\n\r\nJon has been referred to as Australia's geekiest man by the Sydney Morning Herald, and jokingly calls himself a cyborg-in-progress. As part of his \"SuperHouse\" home automation project, Jon has taken keyless entry to an all new level by surgically implanting an RFID chip in his own arm.\r\n\r\nRecently he has been working on ArduSat, a satellite that aims to give hobbyists, students and space enthusiasts an opportunity to design and run their own experiments in space. By choosing a standardised platform based on the hugely popular Arduino hardware design, ArduSat allows anyone to develop and prototype experiments at home using readily accessible parts and all based on a simple open source software environment.\r\n",
      "company": "",
      "present_photo": true,
      "picture": "2f21d8c1-e8b4-4822-b91f-d27f9ca5ee69.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53dd03e2ef70d532f100004d/sanitized_2f21d8c1-e8b4-4822-b91f-d27f9ca5ee69.png",
      "twitter_handle": "@jonoxer"
    },
    {
      "id": "53e89dee3dff5f9a090001c2",
      "name": "Tom Adams",
      "website": "http://adams.id.au/blog/",
      "title": "SVP of Polyglot Engineering at Cogent",
      "bio": "Tom Adams has over 15 years experience in the IT industry as a software engineer, consultant and lecturer. In 2000 he joined the dot com ranks working on projects including PKI-based security infrastructure, advanced web based clients, Windows GUIs and applied Semantic Web technologies. Post dot com, Tom worked in the United States where he participated in two W3C working groups. He has worked in enterprise development for News Limited, Suncorp, Flight Centre & Harvey Norman.\r\n\r\nWith Keith Ahern, Tom founded Oomph (formerly Mogeneration), becoming Australia's leading iPhone, iPad & Android development house before focusing on tablet development with their Oomph platform & marketplace, which has been independently recognised as the #1 tablet app platform in the world.\r\n\r\nHis current interests are based around mobile, high performance & cloud computing, functional programming & agile techniques. He is actively involved in open source, founder of four open source projects (FunctionakKit, Instinct, Obi and Furnace), a developer on FunctionalJava & Scalaz, and a former developer on JRDF & Kowari (now Mulgara).\r\n\r\nTom regularly speaks at local user groups including Brisbane Ruby and Rails, Mobile Monday & CocoaHeads. He founded the Brisbane Functional Programming Group (BFPG) - one of the largest local functional programming groups in the world. He has spoken at national and international conferences including YOW (JAOO), WWW2004, CITCON and OSDC.",
      "company": "",
      "present_photo": true,
      "picture": "5eb6dc69-6e47-4062-95a8-f90b0ebea7bc.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53e89dee3dff5f9a090001c2/sanitized_5eb6dc69-6e47-4062-95a8-f90b0ebea7bc.png",
      "twitter_handle": "@tomjadams"
    },
    {
      "id": "53f7217ab994ce912900079c",
      "name": "Mark Wolfe",
      "website": "http://www.wolfe.id.au",
      "title": "CTO at Ninja Blocks, Co-organiser of Melbourne Go User Group",
      "bio": "Mark Wolfe is CTO at Ninja Blocks, an Australian startup based in Sydney which has been shipping a hacker friendly IoT product for the last couple of years. He has been working in the software industry for the last 15 years, mostly building software and solutions for customers in the Telecommunications and Government sectors. \r\n\r\nMark has been an open source developer for many years, having written and contributed to a wide array of projects, mostly around Linux, messaging and distributed systems.\r\n\r\nCurrently he is also co-organiser of the Melbourne go users group, which he speaks at regularly.",
      "company": "",
      "present_photo": true,
      "picture": "c2da80fb-6384-4197-97ff-3b671f2b93d4.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53f7217ab994ce912900079c/sanitized_c2da80fb-6384-4197-97ff-3b671f2b93d4.png",
      "twitter_handle": "@wolfeidau "
    },
    {
      "id": "53f722b4b994cee3a700087b",
      "name": "Branko Minic",
      "website": "https://www.linkedin.com/pub/branislav-minic/92/1a4/74",
      "title": "Android & Middleware Tech Lead at Outware Mobile",
      "bio": "Branko is an Android and Middleware tech lead at Outware Mobile, an Australian company specialising in mobile software development. Branko has over 10 years experience as a software developer in a variety of languages and frameworks including Android, Java, and J2EE . He has developed products for the health, education, finance and government sectors, working with clients such as Coles, Australia Post, Swinburne University, and the Department of Defence. Branko recently led the middleware development team on the Coles Mobile Wallet project, an award winning app with over 10,000 users in the first two months after launch. ",
      "company": "",
      "present_photo": true,
      "picture": "77f0a615-6539-4c6d-a885-f631010a91fb.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53f722b4b994cee3a700087b/sanitized_77f0a615-6539-4c6d-a885-f631010a91fb.png",
      "twitter_handle": null
    },
    {
      "id": "54058b23e0596b60cc000429",
      "name": "Mark Aufflick",
      "website": "http://htb.io/",
      "title": "Software Development Consultant, Organiser of Sydney Cocoaheads",
      "bio": "Mark Aufflick is the founder of The High Technology Bureau, a software development consultancy based in Sydney, organiser of Sydney CocoaHeads and has been co-organiser of Swipe Conference. The fact that he is on the YOW! Connected Program Committee has nothing to do with his talk being accepted. Mark’s work spans finance, healthcare, realestate, social media and geological research. He has been consulting on software development for over two decades and has been involved in the Internet and Apple industries since the mid-90s.",
      "company": "",
      "present_photo": true,
      "picture": "019cae9f-bfd1-4f81-9c31-5976b5032f53.png",
      "thumbnailUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/54058b23e0596b60cc000429/sanitized_019cae9f-bfd1-4f81-9c31-5976b5032f53.png",
      "twitter_handle": "@markaufflick"
    }
  ],
  "blocks": [
    {
      "end": "2014-09-07T23:00:00.000Z",
      "title": "Registration",
      "type": "break",
      "subtitle": "Registration then an overview of today's sessions & introduction of keynote speaker.",
      "start": "2014-09-07T22:00:00.000Z"
    },
    {
      "end": "2014-09-08T00:30:00.000Z",
      "title": "Break",
      "type": "break",
      "subtitle": "",
      "start": "2014-09-08T00:00:00.000Z"
    },
    {
      "end": "2014-09-08T03:30:00.000Z",
      "title": "Lunch",
      "type": "break",
      "subtitle": "",
      "start": "2014-09-08T02:35:00.000Z"
    },
    {
      "end": "2014-09-08T05:30:00.000Z",
      "title": "Break",
      "type": "break",
      "subtitle": "",
      "start": "2014-09-08T05:05:00.000Z"
    },
    {
      "end": "2014-09-08T00:00:00.000Z",
      "title": "",
      "subtitle": "",
      "start": "2014-09-07T23:00:00.000Z",
      "type": "free"
    },
    {
      "end": "2014-09-08T01:15:00.000Z",
      "title": "",
      "subtitle": "",
      "start": "2014-09-08T00:30:00.000Z",
      "type": "free"
    },
    {
      "end": "2014-09-08T02:05:00.000Z",
      "title": "",
      "subtitle": "",
      "start": "2014-09-08T01:20:00.000Z",
      "type": "free"
    },
    {
      "end": "2014-09-08T02:35:00.000Z",
      "title": "",
      "subtitle": "",
      "start": "2014-09-08T02:10:00.000Z",
      "type": "free"
    },
    {
      "end": "2014-09-08T04:15:00.000Z",
      "title": "",
      "subtitle": "",
      "start": "2014-09-08T03:30:00.000Z",
      "type": "free"
    },
    {
      "end": "2014-09-08T05:05:00.000Z",
      "title": "",
      "subtitle": "",
      "start": "2014-09-08T04:20:00.000Z",
      "type": "free"
    },
    {
      "end": "2014-09-08T05:55:00.000Z",
      "title": "",
      "subtitle": "",
      "start": "2014-09-08T05:30:00.000Z",
      "type": "free"
    },
    {
      "end": "2014-09-08T06:25:00.000Z",
      "title": "",
      "subtitle": "",
      "start": "2014-09-08T06:00:00.000Z",
      "type": "free"
    },
    {
      "end": "2014-09-08T07:15:00.000Z",
      "title": "",
      "subtitle": "",
      "start": "2014-09-08T06:30:00.000Z",
      "type": "free"
    },
    {
      "end": "2014-09-08T09:00:00.000Z",
      "title": "Conference Drinks",
      "type": "break",
      "subtitle": "Join us for conference drinks and networking, sponsored by DiUS, just around the corner at Ormond Hall on St. Kilda Road.",
      "start": "2014-09-08T07:15:00.000Z"
    },
    {
      "end": "2014-09-08T23:00:00.000Z",
      "title": "Introductions",
      "type": "break",
      "subtitle": "Overview of today's sessions & introduction of keynote speaker",
      "start": "2014-09-08T22:30:00.000Z"
    },
    {
      "end": "2014-09-09T00:30:00.000Z",
      "title": "Break",
      "type": "break",
      "subtitle": "",
      "start": "2014-09-09T00:00:00.000Z"
    },
    {
      "end": "2014-09-09T03:30:00.000Z",
      "title": "Lunch",
      "type": "break",
      "subtitle": "",
      "start": "2014-09-09T02:35:00.000Z"
    },
    {
      "end": "2014-09-09T05:30:00.000Z",
      "title": "Break",
      "type": "break",
      "subtitle": "",
      "start": "2014-09-09T05:05:00.000Z"
    },
    {
      "end": "2014-09-09T00:00:00.000Z",
      "title": "",
      "subtitle": "",
      "start": "2014-09-08T23:00:00.000Z",
      "type": "free"
    },
    {
      "end": "2014-09-09T01:15:00.000Z",
      "title": "",
      "subtitle": "",
      "start": "2014-09-09T00:30:00.000Z",
      "type": "free"
    },
    {
      "end": "2014-09-09T02:05:00.000Z",
      "title": "",
      "subtitle": "",
      "start": "2014-09-09T01:20:00.000Z",
      "type": "free"
    },
    {
      "end": "2014-09-09T02:35:00.000Z",
      "title": "",
      "subtitle": "",
      "start": "2014-09-09T02:10:00.000Z",
      "type": "free"
    },
    {
      "end": "2014-09-09T04:15:00.000Z",
      "title": "",
      "subtitle": "",
      "start": "2014-09-09T03:30:00.000Z",
      "type": "free"
    },
    {
      "end": "2014-09-09T05:05:00.000Z",
      "title": "",
      "subtitle": "",
      "start": "2014-09-09T04:20:00.000Z",
      "type": "free"
    },
    {
      "end": "2014-09-09T06:15:00.000Z",
      "title": "",
      "subtitle": "",
      "start": "2014-09-09T05:30:00.000Z",
      "type": "free"
    },
    {
      "end": "2014-09-09T07:05:00.000Z",
      "title": "",
      "subtitle": "",
      "start": "2014-09-09T06:20:00.000Z",
      "type": "free"
    }
  ],
  "partners": [],
  "sessions": [
    {
      "speakers": ["53dd03e2ef70d532f100004d"],
      "description": "Running an experiment in space usually requires custom hardware to be launched into orbit at enormous cost. ArduSat is a project designed to change that, by maintaining a fleet of general purpose experimental satellites in orbit and allowing anyone with an interest in space science to design and run their own experiments right from their computer. The first three ArduSat satellites have already been launched and many more are on the way. Jonathan Oxer designed the general purpose experiment module called the Payload Processor Module that was launched into orbit in ArduSat-1 and ArduSat-X, allowing anyone from hobbyists and school students to professional researchers to run their own experiments in space. In this talk he'll explain the background of the ArduSat project, the CubeSat satellite architecture, how satellites get into orbit, and the operation of the Payload Processor Module, showing how you can run your very own experiments in orbit.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53dd03e2ef70d532f100004d/sanitized_2f21d8c1-e8b4-4822-b91f-d27f9ca5ee69.png",
      "url": "https://www.google.com/events/io",
      "startTimestamp": "2014-09-07T23:00:00Z",
      "title": "ArduSat: Open Source In Orbit",
      "mainTag": "FLAG_KEYNOTE",
      "endTimestamp": "2014-09-08T00:00:00Z",
      "color": "#3f51b5",
      "hashtag": "keynote",
      "isLivestream": false,
      "captionsUrl": "",
      "id": "__keynote__",
      "tags": [
        "FLAG_KEYNOTE"
      ],
      "room": "keynote"
    },
    {
      "speakers": ["53c3c3583a502760d1000017","53c3c3813a50271d08000019"],
      "description": "WWDC 14 has been called the most important WWDC since the announcement of the original SDK in 2008. Apple announced a new language, additions to the APIs available, and structural changes to iOS codebases. This presents a set of challenges to codebases of substantial size which were structured according to best practices in previous versions of iOS. If you must maintain a legacy application with backwards compatibility, what improvements are available to you and which are dead ends? \n\nThe situation is still in flux. We intend this talk to clarify the situation for developers and project managers so that they know what is easy, difficult or impossible when transitioning legacy projects to Swift and iOS8",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c3c3583a502760d1000017/sanitized_bc4a7f72-8d3a-4e93-a8a2-dee7ab4f4ded.png",
      "title": "Integrating Swift and iOS8 in existing applications",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-08T00:30:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_IOS",
        "TOPIC_GENERAL"
      ],
      "mainTag": "TOPIC_IOS",
      "id": "1",
      "color": "#fcbfca",
      "room": "red",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-08T01:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53bc9d8830f4a0dc6400014c"],
      "description": "Android is becoming the OS of choice for those needing an easy to use embedded operating system. \n\nI've spent the last 2.5 years building customised versions of Android to run on various devices for use in the digital signage. \n\nIn this talk, I'll cover the basics of what's involved in customising Android to work as an embedded OS, with examples for things like video-walls and interactive kiosks and then look at how that can then be extended to sensors and outputs to let your Android device interact with the world and people around it. \n\nThere will be code examples, tips for potential pitfalls and coverage of some of the lessons learnt while building devices that are used by opeople out in the real world vs testers in labs.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53bc9d8830f4a0dc6400014c/sanitized_efa302c1-9b10-45bc-b28d-bfa25ea47631.png",
      "title": "Customising Android: Looking inside the droids belly",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-08T00:30:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_ANDROID",
        "TOPIC_IOT"
      ],
      "mainTag": "TOPIC_ANDROID",
      "id": "2",
      "color": "#b9e2f6",
      "room": "blue",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-08T01:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53cf829a82350812d1000157"],
      "description": "This talk will provide attendees with practical advice for securing iOS applications against the vulnerabilities that are most prevalent on the iOS platform. \n\nThe presentation will draw from the security assessments and code reviews I have performed for clients ranging from large financial institutions and government organisations to small development houses. \n\nIt is aimed at anyone interested in designing and developing secure iOS applications and will cover key security controls to mitigate iOS application security risks. Topics covered include: \n\n* Understanding the risk profile of iOS applications \n* Storing data securely \n* Managing sensitive data leakage \n* Implementing effective transport security \n* Developing robust and secure authentication mechanisms \n* Implementing secure and robust runtime security checks",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53cf829a82350812d1000157/sanitized_3142e6f0-4a4e-490f-83a9-2aed4c884e00.png",
      "title": "Developing Secure iOS Applications",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-08T01:20:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_IOS"
      ],
      "mainTag": "TOPIC_IOS",
      "id": "3",
      "color": "#fcbfca",
      "room": "red",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-08T02:05:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53c3a83208739813f300000d"],
      "description": "The speaker will talk about the variety of problems that could arise, and things to consider when trying to support a vast array of android versions and devices. Building an app that can run seamlessly on any android device is one of the major challenges to get those five stars and being featured on PlayStore. \n\nThis talk will be mainly focused on development with numerous examples and techniques of the most common android development problems. All these combined with tips and tools will help you reduce the android fragmentation gap.\n\nExamples that we’ll cover include\n* supporting variety of screens\n* reusing software components\n* improving performance\n* UI and development tips and patterns\n* most common issues caused by the fragmentation, and how to fix them\n* tools that can help you create a great app\n\nAttendees will learn on this talk how to approach android application development challenges, with confidence that their apps will be compatible across the pool of varieties of android powered devices.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c3a83208739813f300000d/sanitized_7b93b917-892c-4125-af77-f74fe015cc80.png",
      "title": "Working in the Android ecosystem - handling the vast array of versions and devices",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-08T01:20:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_ANDROID"
      ],
      "mainTag": "TOPIC_ANDROID",
      "id": "4",
      "color": "#b9e2f6",
      "room": "blue",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-08T02:05:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53ce0dd1513b8879b6000084"],
      "description": "A behind the scenes look at the design and development of Cook - The World's Cook Book. \n\nCook is a social Cook Book for iPad, helping people create, share and discover beautiful recipes with family, friends and the world. \n\nReleased with iOS 7 in September 2013, Cook reached over 500,000 downloads in just three weeks, becoming the #1 Food and Drink app in over 100 countries, featured on Apple's iPad Air Site and awarded App Store's Best of 2013. \n\nThis talk looks at the challenges faced by the team from developing an App designed specifically for iPad to making an engaging and social content creation experience and the impacts of iOS 7 in the last months of development. \n\nIt will explore the iterative and collaborative process used by the team both up to the initial launch and in the ongoing development of the App, a process that encourages using any tool to help further understanding and never being afraid to throwaway work to make a superior experience.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53ce0dd1513b8879b6000084/sanitized_fecac235-5fbe-483a-88d7-60a6345ad293.png",
      "title": "Behind the scenes at Cook",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-08T02:10:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_IOS"
      ],
      "mainTag": "TOPIC_IOS",
      "id": "5",
      "color": "#fcbfca",
      "room": "red",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-08T02:35:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53ce39c205421071410000f0","53ce380d513b8879b60000f2","53ce3c02513b88abf80000f9","53ce3b2e05421034470000f3"],
      "description": "Wotif.com has embarked on a journey to unify its experience across the travel planning process. An essential part of this included the ability to make the crucial parts of its services discoverable and quickly consumable. \nWith a combination of state-of-art technologies and leveraging the concepts of Hypermedia as the Engine of Application State (HATEOAS) we have simplified the process of consuming our content and inventory. We have achieved this across all our user touching platforms from our website to native iOS and Android applications. We would love to share this journey with you.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53ce39c205421071410000f0/sanitized_0a3d4dc3-1aff-4326-8c7b-c77cb0529ac4.png",
      "title": "Rapidly consuming your APIs with code generation and Swagger - a wotif.com example",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-08T02:10:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_IOS",
        "TOPIC_GENERAL"
      ],
      "mainTag": "TOPIC_IOS",
      "id": "6",
      "color": "#b9e2f6",
      "room": "blue",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-08T02:35:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53c48f953a50271d080000c8"],
      "description": "Very few apps these days are self-contained silos. In all likelihood, your app will need to consume data from external sources. In this session, you'll learn how to properly write networking code so that you don't block threads, don't fetch data you don't need, and cache data to avoid. We'll dive deep into caching semantics to enable us to have the right balance between fresh data and a good user experience. All of this will be accomplished this by leveraging the new networking APIs in iOS 7. We'll also cover some techniques you can use on the API side to make life easy for mobile clients.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c48f953a50271d080000c8/sanitized_d7853c52-77c2-4a1d-ac81-ad5596f57b08.png",
      "title": "Effective iOS Networking",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-08T03:30:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_IOS"
      ],
      "mainTag": "TOPIC_IOS",
      "id": "7",
      "color": "#fcbfca",
      "room": "red",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-08T04:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53f722b4b994cee3a700087b"],
      "description": "Android L has brought with it a variety of changes, including the Material design for the UI, and tools to aid in the analysis of power consumption. The speaker will walk through an example of how to convert an existing Holo app to utilise Material design. In addition to reskinning the application, the presenter will identify, analyse and improve the battery performance of the app, while maintaining a high user experience.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53f722b4b994cee3a700087b/sanitized_77f0a615-6539-4c6d-a885-f631010a91fb.png",
      "title": "The Android winds of change: Kit-Kat to L, and the power of saving power",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-08T03:30:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_ANDROID"
      ],
      "mainTag": "TOPIC_ANDROID",
      "id": "8",
      "color": "#b9e2f6",
      "room": "blue",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-08T04:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53c4ef50ae37c75eb300000a"],
      "description": "As a freelancer, many of the customers I work with have extensive iOS experience, but little or no Android dev experience.  iOS focused organisations and developers have many questions about Android development: About the android ecosystem, fragmentation, test devices, app design, libraries to use and what to expect from Android development. Making the situation even worse there is a large amount of hyperbole and uninformed opinions spouted online by the supporters and detractors of both operating systems. \n\nWe will cover many of the common questions those with iOS experience have about Android, providing concrete advice on subjects such as dealing with multiple screen sizes, choosing test devices, what versions of android to support, etc. We will discuss the Android ecosystem and the business aspects of building Android applications. Finally we will conclude with some short code examples, showing how to use the Android SDK to create a simple 'hello world' project in Android studio.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c4ef50ae37c75eb300000a/sanitized_e03a6979-abff-4d4f-baa6-4f2fb66f5eca.png",
      "title": "Android for iOS people",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-08T04:20:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_IOS",
        "TOPIC_ANDROID"
      ],
      "mainTag": "TOPIC_IOS",
      "id": "9",
      "color": "#fcbfca",
      "room": "red",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-08T05:05:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53be5fcc56aa1aad3a000004"],
      "description": "Learn how you can implement presentation model like MVVM in Android to achieve better separation of concerns, maintainability and testability. We will explore approaches to implement MVVM along with choices of using a third party data binding library.\n\nFurther this session will extend the discussion on how this approach can help you share common code path across multiple mobile platforms.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53be5fcc56aa1aad3a000004/sanitized_91e9fe3d-ff82-4aff-8cd2-9478c8bf41c3.png",
      "title": "Write cleaner, maintainable, testable code in Android with MVVM",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-08T04:20:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_ANDROID",
        "TOPIC_GENERAL"
      ],
      "mainTag": "TOPIC_ANDROID",
      "id": "10",
      "color": "#b9e2f6",
      "room": "blue",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-08T05:05:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53bfe88e4ec0fd85a800001b","53ce24af513b88d51d0000a7"],
      "description": "Building an app is easy, right? 16 year-olds build million dollar apps in their garages every other day. But things get a little trickier when the app you’re building is for a bank. \n\nDesigning and coding an app with lots of cool new features is the easy part. Creating a whole new customer channel, that is effectively the bank’s most highly visited branch, comes with a whole different set of challenges including: \n* Shifting the businesses mindset from a one-off project to treating mobile as a first-class channel that needs to be supported and evolved on an ongoing basis. \n* Provide all the features that customer’s expect from web banking and deliver those in a lean fashion, with a mobile first approach. \n* Balancing security and fraud constraints whilst still making the app easy to use for customers. \n* Pushing the boundaries of traditional brand guidelines that didn’t translate to native mobile environments. \n\nWith a conservative financial institution that’s just beginning to understand how mobile is going to revolutionise its business, you have quite a mountain to climb before your designs can see the light of the app store. \n\nThis is the journey that Toby Pritchard (Suncorp) and Ben Melbourne (ThoughtWorks) have recently been through. In this case study presentation they’ll share the highs and lows they went through while rebuilding and launching the new Suncorp Mobile Bank App.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53bfe88e4ec0fd85a800001b/sanitized_43ab8c5a-4f66-48b0-8e70-80f7b4a62a1b.png",
      "title": "Building a bank’s biggest branch",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-08T05:30:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_GENERAL"
      ],
      "mainTag": "TOPIC_GENERAL",
      "id": "11",
      "color": "#fcbfca",
      "room": "red",
      "hashtag": "general",
      "isLivestream": false,
      "endTimestamp": "2014-09-08T05:55:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53c3c1b80873983879000016"],
      "description": "Unless you operate at the truly big end of the web, the economics and market pressures of modern application development are all skewed toward developer productivity. Go faster, ship sooner. In this world of financial sympathy, we lose touch with the very thing that brought us here in the first place: the computer. \n\nDon't settle for the monoculture of mechanical hostility. We can all be better, wiser developers by re-learning the forgotten idioms of the hardware; clock cycles and CPU instructions, registers and the stack. \n\nIn this presentation you'll see how nothing more than a few strips of LEDs is enough to render all your higher level languages useless, and how a developer who thought he understood computers found that he didn't really understand them at all...",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c3c1b80873983879000016/sanitized_1244c881-15dd-4503-b41b-5993b834fc03.png",
      "title": "When C is too slow: Re-discovering the computer",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-08T05:30:00Z",
      "tags": [
        "THEME_IOT",
        "TYPE_SESSIONS",
        "TOPIC_IOT"
      ],
      "mainTag": "TOPIC_IOT",
      "id": "12",
      "color": "#b9e2f6",
      "room": "blue",
      "hashtag": "iot",
      "isLivestream": false,
      "endTimestamp": "2014-09-08T05:55:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53c3c3b83a50279fa400001b","53ce2c8a0542101d040000aa"],
      "description": "In this session, I will summarise what we think makes a good children's app from both a design and a technical perspective, with examples from our own work and others. Attendees will come away with a set of solid dos and don'ts for building mobile games for children.\n\nWhat gestures are good in children's games? Does load time matter? Why shouldn't you include 'trash can' imagery? Is there a right way to do in-app purchases in kids games?",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c3c3b83a50279fa400001b/sanitized_ac7b6c64-6767-440b-9b5f-770637385202.png",
      "title": "How to build games for children",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-08T06:00:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_GENERAL"
      ],
      "mainTag": "TOPIC_GENERAL",
      "id": "13",
      "color": "#fcbfca",
      "room": "red",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-08T06:25:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53cde1580542103447000056"],
      "description": "You’ll learn about the journey of taking Smash, a wearable tech startup for tennis, from an early idea to being production ready. The talk will focus on the technical aspects of the hardware and software evolution, but some context of the startup business will be discussed to frame the conversation.\n\nFrom a technical perspective, Smash began as a generic prototype used to gather data around tennis play. Countless hours of data gathering and analysis was done over a 12 month period. You’ll see a demonstration of how the prototype works, the raw data, and the pattern matching heuristics that evolved from the process. The details of the sensors inside the device and the technical trade-offs will be discussed.\n\nFollowing the prototype stage, the device underwent a physical transformation through engagements with manufacturing and industrial design companies. You’ll see that evolution and the final design prototype.\n\nWith all of those pieces in place, there’s also the challenge of creating some useful software for consumers to provide genuine value. You’ll see the software design process, and hear the story about how that is progressing.\n\nSmash ran a kickstarter campaign during June & July in an attempt to raise money for the first full manufacturing run and development of the software. You’ll hear about whether that was a success or not, and some thoughts on why it turned out the way it did.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53cde1580542103447000056/sanitized_2aeb7f25-8e90-429f-9117-4f104b065531.png",
      "title": "Smash - Tennis based wearable tech from idea to production",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-08T06:00:00Z",
      "tags": [
        "THEME_IOT",
        "TYPE_SESSIONS",
        "TOPIC_IOT"
      ],
      "mainTag": "TOPIC_IOT",
      "id": "14",
      "color": "#b9e2f6",
      "room": "blue",
      "hashtag": "iot",
      "isLivestream": false,
      "endTimestamp": "2014-09-08T06:25:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["54058b23e0596b60cc000429"],
      "description": "A brief and whirlwind tour of the problem space of designing and implementing BLE communications between mobile apps and custom developed hardware/firmware where all your targets are moving! We will cover formally documenting the specification, why code-generation is good for you, and api and transport governance.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/54058b23e0596b60cc000429/sanitized_019cae9f-bfd1-4f81-9c31-5976b5032f53.png",
      "title": "Bluetooth LE API Design + Code Generation for iOS apps and hardware",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-08T06:30:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_IOS"
      ],
      "mainTag": "TOPIC_IOS",
      "id": "15a",
      "color": "#fcbfca",
      "room": "red",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-08T07:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53ce304a0542101d040000c9"],
      "description": "This talk shows how easy it is with very little experience and skills to design and fabricate your own PCB to create your own OSHW Arduino Shield and to scale that to manufacture in low volumes. All you need is the the right tools and a tiny bit of knowledge. I'll look into how to go from breadboard to prototype to making a few working shields to making shields in small volumes (10 boards) to low volume manufacture (100 boards) with minimal effort and cost.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53ce304a0542101d040000c9/sanitized_4883d6d8-c7d7-43fe-b3f0-f8c867c9ee91.png",
      "title": "Creating your own Open Source Arduino Board",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-08T06:30:00Z",
      "tags": [
        "THEME_IOT",
        "TYPE_SESSIONS",
        "TOPIC_IOT"
      ],
      "mainTag": "TOPIC_IOT",
      "id": "15",
      "color": "#b9e2f6",
      "room": "blue",
      "hashtag": "iot",
      "isLivestream": false,
      "endTimestamp": "2014-09-08T07:15:00Z",
      "captionsUrl": ""
    },

    {
      "speakers": ["53bcaf4330f4a0dc64000194"],
      "description": "Engagement metrics aside, how are the applications you’re making engaging users at an emotional level? How much thinking goes into the personality and tone of your product? Are you thinking comprehensively about every messaging touchpoint your product has with a user?\nWhat about writing the error messages, alerts, calls-to-action, descriptions, or release notes? \n\nJaimee has been helping Fortune 500 companies, agencies, non-profits and startups with digital products for more than 17 years with emphasis on mobile applications for the last 5. What has helped separate the products Jaimee has worked on to stand out from the rest is their ability to engage and empathize with users. Over years of refinement, her process has come to consistently evoke such responses from her clients as, “You’ve earned our trust!”, “You understand who we are!” and “Thank you - We love you!”\n\nWhether you have a concept, a startup, corporation or enterprise product - whether software, website or mobile application - Jaimee wants to share some very important considerations in creating products that connect emotionally with users. In this session Jaimee will walk you through some design and personality thinking, on-boarding dos and don’ts, and copywriting considerations to help your applications become more fun, delightful, and emotionally engaging experiences for your users.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53bcaf4330f4a0dc64000194/sanitized_7a0cae77-2838-44e4-a670-ca5508a42dcb.png",
      "url": "https://www.google.com/events/io",
      "startTimestamp": "2014-09-08T23:00:00Z",
      "title": "Designing Engagement",
      "mainTag": "FLAG_KEYNOTE",
      "endTimestamp": "2014-09-09T00:00:00Z",
      "color": "#3f51b5",
      "hashtag": "keynote",
      "isLivestream": false,
      "captionsUrl": "",
      "id": "__keynote2__",
      "tags": [
        "FLAG_KEYNOTE"
      ],
      "room": "keynote"
    },
    {
      "speakers": ["512eecd8e7f0eca3f000003e"],
      "description": "Microservices are all the buzz for backend development, but can the same lessons be applied to how we develop apps on the client side? In this presentation, I'll show approaches for splitting up your iOS code to make it easier to maintain your code, isolate legacy Objective C and adopt frameworks and tools from iOS 7 and 8 without having to rewrite your app from scratch. The content will help inform how new apps can be developed as well as how to evolve existing an codebase. \n\nWith the rapid pace of change on the iOS platform, we need to start thinking of our apps in terms of smaller components that we can develop, iterate or throw away quickly. I present some of the approaches used on the REA apps and elsewhere. The presentation will be based on the general principles and benefits of composing systems from smaller services, and how that applies to iOS application, including: \n\n* examples of the use of microservices in REA backend systems to promote rapid development and deployment of new functionality \n* groups of functionality that can be thought of as a client-side microservice, and how to manage these dependencies \n* workspace and project structures to develop apps from smaller components, for both iOS 7 and 8 using static libraries, cocoapods or frameworks \n* configuration to allow for multiple features to be developed in parallel \n* approaches for automated testing to allow these smaller components to be developed without the need to manually test the entire application \n* tools to quickly bootstrap new iOS libraries and integrate them into your existing projects \n* examples of using this approach for building 1form.com.au components into the realestate.com.au apps",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/512eecd8e7f0eca3f000003e/sanitized_f078486a-0af4-4764-9978-3f9955246c8c.png",
      "title": "A microservice mindset for iOS development",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-09T00:30:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_IOS"
      ],
      "mainTag": "TOPIC_IOS",
      "id": "16",
      "color": "#fcbfca",
      "room": "red",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-09T01:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53cf8cfb823508f8b100016b"],
      "description": "Learn about Gadgeteer and Netduino prototyping devices, designed for education, hobbyists and start-ups looking to perfect an idea. Understand Windows Embedded for commercial opportunities supporting scenarios such as package delivery, point-of-service and scan-capture. Bring it all together with Microsoft Azure cloud services including secure communications services enabled by Intelligent Systems Services and deep data analysis with the Microsoft data platform.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53cf8cfb823508f8b100016b/sanitized_9c69d858-ddc3-4f4a-bd3d-9dc41bf38384.png",
      "title": "Microsoft and the Internet of Things",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-09T00:30:00Z",
      "tags": [
        "THEME_IOT",
        "TYPE_SESSIONS",
        "TOPIC_IOT"
      ],
      "mainTag": "TOPIC_IOT",
      "id": "17",
      "color": "#b9e2f6",
      "room": "blue",
      "hashtag": "iot",
      "isLivestream": false,
      "endTimestamp": "2014-09-09T01:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["535b129681e8b002560003a9"],
      "description": "A large percentage of iOS apps today use Core Data for persistence, but is this always the right option? \n\nNoSQL databases offer a compelling alternative in web applications, but developers seem firmly attached to a relational model on the device. There are a number of scenarios where this can deliver sub-optimal outcomes, such as query performance and data sync. This presentation will cover these issues and present a few alternatives, focusing on practical demonstrations of specific NoSQL approaches on iOS, however the concepts are highly applicable to other mobile platforms.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/535b129681e8b002560003a9/sanitized_8a0e3b95-f175-4fc2-b13d-c95bc9f900d4.png",
      "title": "Beyond Core Data: NoSQL for Mobile",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-09T01:20:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_IOS",
        "TOPIC_GENERAL"
      ],
      "mainTag": "TOPIC_IOS",
      "id": "18",
      "color": "#fcbfca",
      "room": "red",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-09T02:05:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53c747b4a91dac5e12000046"],
      "description": "An enterprise and productivity biased talk about design and development for more than just Glass and Android Wear, delving into the technical and ergonomic limitations of the latest wearables to hit the market. \n\nLinden's been working on head-mounted wearable apps to help doctors perform their duties more efficiently, while keeping things real (busy) designing and developing clockface apps for the more recent Android smartwatches. Join him as he unfurls lessons learnt in doing all the usual stuff plus attempting to disrupt the healthcare industry, targeting more than just Glass, and \"responsible\" design.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c747b4a91dac5e12000046/sanitized_5509def7-77fc-4890-aa42-d86e7c7d4fb0.png",
      "title": "Wearing Android",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-09T01:20:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_ANDROID",
        "TOPIC_GENERAL"
      ],
      "mainTag": "TOPIC_ANDROID",
      "id": "19",
      "color": "#b9e2f6",
      "room": "blue",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-09T02:05:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53c3c3b83a50279fa400001b","53ce2c8a0542101d040000aa"],
      "description": "Connected devices that support 'hackable' software development are becoming increasingly common: the Lifx, the Holiday by MooresCloud, Philips Hue, and so on. \n\nThis talk will explore the development of a number of iOS apps built for the Holiday by MooresCloud, including a device discovery app and a musical visualiser. The talk will summarise the best practices for developing IoT-related apps for iOS, how to talk to such devices in a reliable and network-friendly way, and best practices for UX and interaction with IoT devices. \n\nWe'll showcase our past work, demonstrate what we're working on now, and present a number of demonstrations of our approach to building mobile software for IoT devices.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c3c3b83a50279fa400001b/sanitized_ac7b6c64-6767-440b-9b5f-770637385202.png",
      "title": "Building iOS apps for IoT devices: a case study of the Holiday by MooresCloud",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-09T02:10:00Z",
      "tags": [
        "THEME_IOT",
        "TYPE_SESSIONS",
        "TOPIC_IOS",
        "TOPIC_GENERAL",
        "TOPIC_IOT"
      ],
      "mainTag": "TOPIC_IOT",
      "id": "20",
      "color": "#fcbfca",
      "room": "red",
      "hashtag": "iot",
      "isLivestream": false,
      "endTimestamp": "2014-09-09T02:35:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53cde552054210a60100005b","53e1b54114296fa7820001d4"],
      "description": "Building an Internet of Things for Agriculture presents unique challenges that don't exist in many other domains. The typical agricultural environment is not friendly to electronics, lacks traditional infrastructure such as readily available power and ubiquitous network access. And yet, pervasive monitoring and control combined with cloud based applications and big data analytics offers productivity gains that our world-wide agricultural production systems desperately need. \nIn order to move beyond the enthusiast scale, and deliver these benefits at large scale a business has to move beyond the maker model, and deliver scalable, robust systems that can survive in all manner of environmental conditions, delivering predictable & reliable results. \n\nThis talk will cover a wide range of technical areas, all of which have been brought together to provide solutions to dramatically improve water and energy use efficiency in agricultural enterprises in Australia and the USA: \n* embedded low-power hardware design \n* firmware development and over-the-air upgrades \n* ad-hoc, multi-radio networks for low power operation \n* in-field sensing & data collection methodologies \n* large geographic scale data aggregation \n* cloud based data warehousing and analytics \n\nAttendees will leave the talk with a real sense of what is required to deliver an Internet of Things borne out of real world experience from a Melbourne based company that has a track record of delivering solutions in this space for many years.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53cde552054210a60100005b/sanitized_97644c6f-a763-4ab5-b573-2845680a1f9b.png",
      "title": "Building an Internet of Farming Things",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-09T02:10:00Z",
      "tags": [
        "THEME_IOT",
        "TYPE_SESSIONS",
        "TOPIC_IOT"
      ],
      "mainTag": "TOPIC_IOT",
      "id": "21",
      "color": "#b9e2f6",
      "room": "blue",
      "hashtag": "iot",
      "isLivestream": false,
      "endTimestamp": "2014-09-09T02:35:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53be62c93b455bd07d000007"],
      "description": "Finally! That's the best way to welcome the announcement of the new WebKit in iOS8. Since the first version of iOS web developers have been struggling with the scarce possibilities of UIWebView. \"It's not like Safari\" was a common complaint. That time is now over and your wishes have come true. In this presentation we will learn about the many new possibilities enabled by the new WebKit framework. In particular we will focus on the bridge between native code and web content.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53be62c93b455bd07d000007/sanitized_491975ad-e679-4cf1-851d-a8a3bbf01ca3.png",
      "title": "The new WebKit is awesome!",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-09T03:30:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_IOS"
      ],
      "mainTag": "TOPIC_IOS",
      "id": "22",
      "color": "#fcbfca",
      "room": "red",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-09T04:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53c4ef50ae37c75eb300000a"],
      "description": "A simple, scalable app architecture using the Android Annotations library will be presented. The app architecture has been used in multiple projects to quickly and reliably produce well architected, maintainable apps, with a minimum of effort. We explore how the Android Annotations library can be used to solve several problems with android application development, such as excessive boiler plate code and dealing with interactions between background tasks and the UI thread.  We will also discuss how this architecture can be easily scaled from small apps with no persistent storage all the way up to complex applications backed by a DB and interacting with multiple web services and 3rd party APIs",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c4ef50ae37c75eb300000a/sanitized_e03a6979-abff-4d4f-baa6-4f2fb66f5eca.png",
      "title": "A simple, scalable app architecture with Android annotations",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-09T03:30:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_ANDROID"
      ],
      "mainTag": "TOPIC_ANDROID",
      "id": "23",
      "color": "#b9e2f6",
      "room": "blue",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-09T04:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["5357b3af5fac669b95000009","5360b0718e061cab9b000a0d"],
      "description": "We'll explore the development of the Fireballs in the Sky app, designed for citizen scientists to record sightings of meteorites (“fireballs”) in the night sky. We'll introduce the maths for AR on a mobile device, using the various sensors, and we'll throw in some celestial mechanics for good measure. We'll discuss the prototyping approach in Processing. We'll describe the iOS implementation, including: libraries, performance tuning, and testing. We'll then do the same for the Android implementation. Or maybe the other way around... \n\nFireballs in the Sky app (iOS: http://bit.ly/1eZ68BA, Android: http://bit.ly/1eK6X1S). Fireballs in the Sky website (http://www.fireballsinthesky.com.au/), sponsored by Curtin University.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/5357b3af5fac669b95000009/sanitized_4a885d43-76b5-470d-b745-444ad00456f4.png",
      "title": "Seeing Stars - Bespoke Augmented Reality",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-09T04:20:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_IOS",
        "TOPIC_ANDROID",
        "TOPIC_GENERAL"
      ],
      "mainTag": "TOPIC_GENERAL",
      "id": "24",
      "color": "#fcbfca",
      "room": "red",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-09T05:05:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53e89dee3dff5f9a090001c2"],
      "description": "This talk outlines our experiences using Scala to build an Android app. We explore the benefits of using Scala instead of Java for Android development. \n\nAttendees will learn the benefits & pitfalls of using Scala to develop an Android app, including guidance on toolchain selection, common libraries & traps to avoid.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53e89dee3dff5f9a090001c2/sanitized_5eb6dc69-6e47-4062-95a8-f90b0ebea7bc.png",
      "title": "Scala on Android: The Good, the Bad, the Ugly",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-09T04:20:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_ANDROID"
      ],
      "mainTag": "TOPIC_ANDROID",
      "id": "25",
      "color": "#b9e2f6",
      "room": "blue",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-09T05:05:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53c55549ae37c798de000029"],
      "description": "In the world of mobile app development, web apps have seemed like an annoying younger sibling: always nagging for attention but not really grown-up enough to play with the big kids. However, just like a real kid-brother or sister, mobile web apps have grown up in recent years. For certain classes of application they now represent a viable proposition, and can even be superior in some circumstances.\n\nThe goal of this presentation is to give attendees an accurate picture of the current state of mobile web development, especially in relation to the native app development world. Attendees will learn what’s possible with the mobile web today, and when it might be preferable to use web technologies to build a mobile app instead of writing it natively. They’ll also learn best-practices in mobile web development, when and how frameworks can help, and when it’s appropriate to build a hybrid app that uses both native and web technologies. \n\nI’ll start with a summary of the current state of mobile web development, talking about how advances in both hardware and web standards over the last couple of years are now enabling a whole new class of mobile web application. \n\nNext I’ll move onto guidelines for when to go native and when to go web. This will include coverage of the limitations of Javascript, CSS3, and mobile browsers in general. We’ll discuss the pros and cons of distributing an app over the web vs an app store. Finally, we’ll compare the development effort of native vs. web development. \n\nAfter that I’ll talk about best practices in mobile app development. This will include a discussion about single-page web apps and their associated frameworks, minimising download and startup times, reducing latency during user interactions, and maximising animation performance. \n\nFinally, I’ll discuss when a hybrid approach (i.e. a web app within a native app) can be useful, from both an app-distribution and hardware-access perspective. This will include a discussion of when a wrapper framework (for example, Phonegap) can be useful, as opposed to just doing it all yourself.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c55549ae37c798de000029/sanitized_00df99ef-6fcc-4236-8acb-1351fad6873e.png",
      "title": "State of the Mobile Web",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-09T05:30:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_GENERAL"
      ],
      "mainTag": "TOPIC_GENERAL",
      "id": "26",
      "color": "#fcbfca",
      "room": "red",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-09T06:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53c761e3e49e205920000042"],
      "description": "Web developers across the globe have been empowering the web with JavaScript applications for years and have been taking the scripting language to new heights above and beyond its original implementations. Through the power of JavaScript APIs, frameworks and open web APIs, JavaScript developers can expand their existing skill set to empower devices and technology poised to enter the homes and attire of the future. In this presentation, I’ll provide an overview of how JavaScript developers can get involved with technology such as Ninja Blocks, Arduinos, the Leap Motion, Android (via on{X}), the Pebble Watch and more. It will provide an overview of the Internet of Things ecosystem from the perspective of the JavaScript development community. \n\nMy presentation will begin with an overview of technology that can use JavaScript in one way or another, whether as its primary form of scripting or as a supporting technology bringing further capabilities to the device. I’ll be covering technology such as Ninja Blocks, Arduinos, the Leap Motion, Android (via on{X}), the Pebble Watch, Google Glass (via Wearscript), Oculus Rift (via vr.js), Raspberry Pi, awe.js, Tessel, Espruino and the Myo armband.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53c761e3e49e205920000042/sanitized_1c7837dd-9742-4e87-bd1c-d7c0e6e65502.png",
      "title": "Stepping into the IoT world with JavaScript",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-09T05:30:00Z",
      "tags": [
        "THEME_IOT",
        "TYPE_SESSIONS",
        "TOPIC_IOT"
      ],
      "mainTag": "TOPIC_IOT",
      "id": "27",
      "color": "#b9e2f6",
      "room": "blue",
      "hashtag": "iot",
      "isLivestream": false,
      "endTimestamp": "2014-09-09T06:15:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53be55cd12ac84a993000076"],
      "description": "The speaker will discuss the challenges involved in creating a cohesive and consistent experience across a rapidly growing number of devices.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53be55cd12ac84a993000076/sanitized_807ec20b-864f-419a-a96b-77a0ad309762.png",
      "title": "Resolution Revolution: Designing for every screen",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-09T06:20:00Z",
      "tags": [
        "THEME_MOBILE",
        "TYPE_SESSIONS",
        "TOPIC_GENERAL",
        "TOPIC_ANDROID",
        "TOPIC_IOS"
      ],
      "mainTag": "TOPIC_GENERAL",
      "id": "28",
      "color": "#fcbfca",
      "room": "red",
      "hashtag": "mobile",
      "isLivestream": false,
      "endTimestamp": "2014-09-09T07:05:00Z",
      "captionsUrl": ""
    },
    {
      "speakers": ["53f7217ab994ce912900079c"],
      "description": "For some time now the proponents of Bluetooth Low Energy (BLE) have promised this technology will deliver cheap and simple solution for locating \"things\" within an indoor space. There have been many attempts at this, with mixed results, now Apple has introduced the much heralded iBeacon does this mean it is ready for consumers?\n\nIn this talk I will dig into what BLE is and how it can be used to provide location indoors, then move onto some of the experience we have had using it at Ninja Blocks, what worked, what didn't, and how we are planning on using this technology in our products.",
      "photoUrl": "https://confuiimagesproduction.s3.amazonaws.com/uploads/speaker/photo/53f7217ab994ce912900079c/sanitized_c2da80fb-6384-4197-97ff-3b671f2b93d4.png",
      "title": "Using Bluetooth Low Energy for Location?",
      "url": "https://www.google.com/events/io/schedule/session/5e5915de-0ce1-e311-b297-00155d5066d7",
      "startTimestamp": "2014-09-09T06:20:00Z",
      "tags": [
        "THEME_IOT",
        "TYPE_SESSIONS",
        "TOPIC_IOT"
      ],
      "mainTag": "TOPIC_IOT",
      "id": "29",
      "color": "#b9e2f6",
      "room": "blue",
      "hashtag": "iot",
      "isLivestream": false,
      "endTimestamp": "2014-09-09T07:05:00Z",
      "captionsUrl": ""
    }
  ],
  "video_library": [
    {
      "vid": "9pmPa_KxsAM",
      "title": "Google I/O 2013 Keynote",
      "topic": "",
      "year": "2013",
      "thumbnailUrl": "http://img.youtube.com/vi/9pmPa_KxsAM/hqdefault.jpg",
      "id": "9pmPa_KxsAM",
      "desc": "Google I/O 2013 Keynote"
    }
  ],
  "hashtags": [
    {
      "color": "#303f9f",
      "order": 1,
      "name": "#yowconnected",
      "description": "Follow the general Google+ social conversation happening around YOW! Connected 2014."
    },
    {
      "color": "#9fa8da",
      "order": 4,
      "name": "#yowconnected #keynote",
      "description": "Follow the Google+ social conversation about the Keynote at YOW! Connected 2014."
    },
    {
      "color": "#80cbc4",
      "order": 5,
      "name": "#yowconnected #afterhours",
      "description": "Check out the highlights of the After Hours."
    },
    {
      "color": "#3f51b5",
      "order": 2,
      "name": "#yowconnected #mobile",
      "description": "Follow the Google+ social conversation about \"Mobile\" at YOW! Connected 2014."
    },
    {
      "color": "#03a9f4",
      "order": 3,
      "name": "#yowconnected #iot",
      "description": "Follow the Google+ social conversation about \"Internet of Things\" at I/O 2014."
    }
  ],
  "experts": [],
  "rooms": [
    {
      "original_id": "a297ea70-e2e1-e311-b297-00155d5066d7",
      "id": "keynote",
      "name": "Keynote"
    },
    {
      "original_id": "09e884ab-5cd5-e311-b297-00155d5066d7",
      "id": "red",
      "name": "Red Room"
    },
    {
      "original_id": "09e884ab-5cd5-e311-b297-00155d5066d7",
      "id": "blue",
      "name": "Blue Room"
    }
  ],
  "tags": [
    {
      "category": "TOPIC",
      "name": "iOS",
      "color": "#607d8b",
      "abstract": "",
      "tag": "TOPIC_IOS",
      "original_id": "t1",
      "order_in_category": 1
    },
    {
      "category": "TOPIC",
      "name": "Android",
      "color": "#607d8b",
      "abstract": "",
      "tag": "TOPIC_ANDROID",
      "original_id": "t2",
      "order_in_category": 2
    },
    {
      "category": "TOPIC",
      "name": "Internet of Things",
      "color": "#607d8b",
      "abstract": "",
      "tag": "TOPIC_IOT",
      "original_id": "t3",
      "order_in_category": 3
    },
    {
      "category": "TOPIC",
      "name": "General",
      "color": "#607d8b",
      "abstract": "",
      "tag": "TOPIC_GENERAL",
      "original_id": "t4",
      "order_in_category": 4
    },
    {
      "category": "TYPE",
      "name": "Sessions",
      "abstract": "",
      "tag": "TYPE_SESSIONS",
      "original_id": "08e12eae-a487-e311-84db-00155d5066d7",
      "order_in_category": 1
    },
    {
      "category": "THEME",
      "name": "Mobile",
      "abstract": "",
      "tag": "THEME_MOBILE",
      "original_id": "41335208-8ed0-e311-b297-00155d5066d7",
      "order_in_category": 1
    },
    {
      "category": "THEME",
      "name": "Internet of Things",
      "abstract": "",
      "tag": "THEME_IOT",
      "original_id": "41335208-8ed0-e311-b297-00155d5066d7",
      "order_in_category": 2
    }
  ]
}